linux/linuxos/CentOS集群安装OpenStack.org
#+OPTIONS: ^:{} _:{} num:t toc:t \n:t
#+INCLUDE: "../../layout/template.org"
#+SETUPFILE: "../../layout/extension.org"
#+title:
* COMMENT COMMENTS
** COMMENT 安装指导
   https://openstack.redhat.com/Quickstart
   http://blog.sina.com.cn/s/blog_7f0154140101cplh.html
   http://blog.csdn.net/eric_sunah/article/details/39475815
** COMMENT 配置第2块网卡
   #+BEGIN_EXAMPLE
   ifcfg em2 add 192.168.2.103/24
   #+END_EXAMPLE
   hostname为node3
   #+BEGIN_EXAMPLE
   vhostname=`hostname`;vipaddr="192.168.2.10"${vhostname:4}"/24";ifcfg em2 $vipaddr;unset vhostname; unset vipaddr;
   #+END_EXAMPLE
** COMMENT EPEL
   http://www.tecmint.com/how-to-enable-epel-repository-for-rhel-centos-6-5/
   http://freeloda.blog.51cto.com/2033581/1260824
   #+BEGIN_EXAMPLE
   rpm -ivh http://dl.fedoraproject.org/pub/epel/6/x86_64/epel-release-6-8.noarch.rpm
   rpm --import /etc/pki/rpm-gpg/RPM-GPG-KEY-EPEL-6
   #+END_EXAMPLE
   修改/etc/yum.repos.d/epel.repo中的enabled=0全部改为1
   #+BEGIN_EXAMPLE
   yum clean all
   yum repolist | grep epel
   #+END_EXAMPLE
   如果显示结果不为空，类似
   #+BEGIN_EXAMPLE
   epel                Extra Packages for Enterprise Linux 6 - x86_64     11,102+37
   #+END_EXAMPLE
   表示EPEL配置完成。
** COMMENT 安装过程中自动禁止epel repo
   EPEL被禁导致许多依赖安装不上。
   https://ask.openstack.org/en/question/51013/rdo-deploy-openstack-error-execution-of-usrbinyum-d-0-e-0-y-list-erlang-returned-1-error-no-matching-packages-to-list/
   默认的CONFIG_USE_EPEL=n，将其改成y即可。
   或 if packstack --allinone,the default value of epel option now is "CONFIG_USE_EPEL=n",you can execute "#yum-config-manager --enable epel" after "Preparing servers [ DONE ]" to enable epel repo
** COMMENT 安装erlang出错
   http://blog.csdn.net/duyuanhai/article/details/17403213
** COMMENT 安装rabbitmq出错
   http://blog.csdn.net/leekwen/article/details/23333659
** COMMENT 卸载RDO
   https://openstack.redhat.com/Uninstalling_RDO
** COMMENT 彻底删除MySQL
   http://blog.csdn.net/hi_1234567/article/details/9176715
   http://blog.phpdr.net/linux-delete-mysql-complete.html
** COMMENT MySQL出错
  彻底删除MySQL
  https://ask.openstack.org/en/question/51441/mysqladmin-u-root-password-023b6b3e53494c39-returned-1-instead-of-one-of-0/
  #+BEGIN_EXAMPLE
rm -rf /var/lib/mysql
rm -rf /etc/mysql*  
  #+END_EXAMPLE
  http://blog.csdn.net/nel0511/article/details/13091163
  修改密码
  http://blog.csdn.net/pumaadamsjack/article/details/2044565  
  mysqladmin -u root -p password 123456
** COMMENT cron出错
   yum install yum-cron
** COMMENT 网上配置
  http://www.centoscn.com/CentOS/config/2013/0730/796.html
http://my.oschina.net/captaintheron/blog/3046

ip route flush table net2
ip route add default via 192.168.1.1 dev em1 src 192.168.1.103 table net2
ip rule add from 192.168.1.103 table net2
ip route flush table net3
ip route add default via 192.168.2.1 dev em2 src 192.168.2.103 table net3
ip rule add from 192.168.2.103 table net3

sed -i 's/ONBOOT=no/ONBOOT=yes/g' /etc/sysconfig/network-scripts/ifcfg-em2
sed -i /GATEWAY=192.168.2.1/d /etc/sysconfig/network-scripts/ifcfg-em2
service network restart

** COMMENT 杂
   http://www.litrin.net/2014/03/05/%E6%90%AD%E5%BB%BAopenstack%E9%9B%86%E7%BE%A4/
   http://blog.csdn.net/huangmeng1214/article/details/12707953
** COMMENT 如何添加一个计算结点
   https://openstack.redhat.com/Adding_a_compute_node
** COMMENT dokuwiki
   启动httpd后外网无法访问 http://slj.me/2010/12/centos-apache-firewall-settings/
