linux/linuxos/CentOS集群安装OpenStack.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title></title>
<!-- 2015-07-16 Thu 13:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. OpenStack命令</a>
<ul>
<li><a href="#sec-1-1">1.1. 帮助</a></li>
<li><a href="#sec-1-2">1.2. nova network-list</a></li>
<li><a href="#sec-1-3">1.3. nova-manage service list</a></li>
<li><a href="#sec-1-4">1.4. image操作</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. nova image-list</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. tenant/user/role</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. 创建用户/租户/角色</a></li>
<li><a href="#sec-1-5-2">1.5.2. 列出用户/租户/角色</a></li>
<li><a href="#sec-1-5-3">1.5.3. 添加用户到指定租户和角色中</a></li>
<li><a href="#sec-1-5-4">1.5.4. 服务向Keystone注册服务的Endpoint</a></li>
<li><a href="#sec-1-5-5">1.5.5. 查看指定tenant的指定user的role</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6. 安全组</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1. nova secgroup-list</a></li>
<li><a href="#sec-1-6-2">1.6.2. nova secgroup-create GroupName Description</a></li>
<li><a href="#sec-1-6-3">1.6.3. nova secgroup-delete GroupName</a></li>
<li><a href="#sec-1-6-4">1.6.4. nova secgroup-list-rules GROUPNAME</a></li>
<li><a href="#sec-1-6-5">1.6.5. nova secgroup-add-rule default tcp 22 22 0.0.0.0/0</a></li>
<li><a href="#sec-1-6-6">1.6.6. nova secgroup-add-rule default icmp -1 -1 0.0.0.0/0</a></li>
</ul>
</li>
<li><a href="#sec-1-7">1.7. floating ip</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1. nova floating-ip-create</a></li>
<li><a href="#sec-1-7-2">1.7.2. nova floating-ip-associate InstanceNameOrID  Floating-Ip-Address</a></li>
</ul>
</li>
<li><a href="#sec-1-8">1.8. VM操作</a>
<ul>
<li><a href="#sec-1-8-1">1.8.1. nova boot &#x2013;flavor FLAVORTYPE &#x2013;key_name KEYPAIRNAME &#x2013;image IMAGEID NEWINSTANCENAME</a></li>
<li><a href="#sec-1-8-2">1.8.2. nova delete VMName</a></li>
</ul>
</li>
<li><a href="#sec-1-9">1.9. flavor操作</a>
<ul>
<li><a href="#sec-1-9-1">1.9.1. nova flavor-list</a></li>
<li><a href="#sec-1-9-2">1.9.2. nova flavor-create FLAVOR_NAME FLAVOR_ID RAM_IN_MB ROOT_DISK_IN_GB NUMBER_OF_VCPUS</a></li>
<li><a href="#sec-1-9-3">1.9.3. nova flavor-access-add FLAVOR TENANT_ID</a></li>
</ul>
</li>
<li><a href="#sec-1-10">1.10. hypervisor</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 经验</a>
<ul>
<li><a href="#sec-2-1">2.1. 重启OpenStack</a></li>
<li><a href="#sec-2-2">2.2. 删除顺序</a></li>
<li><a href="#sec-2-3">2.3. 端口映射访问VNC</a></li>
<li><a href="#sec-2-4">2.4. 自己创建镜像</a></li>
<li><a href="#sec-2-5">2.5. 虚拟机启动时执行语句</a></li>
<li><a href="#sec-2-6">2.6. 修改镜像用户名和密码</a></li>
<li><a href="#sec-2-7">2.7. 对象存储</a></li>
<li><a href="#sec-2-8">2.8. 查看指定VM在哪台物理机上运行</a></li>
<li><a href="#sec-2-9">2.9. 制作镜像</a>
<ul>
<li><a href="#sec-2-9-1">2.9.1. 安装底层支持包</a></li>
<li><a href="#sec-2-9-2">2.9.2. 下载centos6.5 iso镜像</a></li>
<li><a href="#sec-2-9-3">2.9.3. 启动服务</a></li>
<li><a href="#sec-2-9-4">2.9.4. 创建镜像文件</a></li>
<li><a href="#sec-2-9-5">2.9.5. 创建虚拟机</a></li>
<li><a href="#sec-2-9-6">2.9.6. 利用VNC软件登陆</a></li>
<li><a href="#sec-2-9-7">2.9.7. 安装系统</a></li>
<li><a href="#sec-2-9-8">2.9.8. 配置系统</a></li>
<li><a href="#sec-2-9-9">2.9.9. 安装EPEL源，升级系统</a></li>
<li><a href="#sec-2-9-10">2.9.10. cloud-init等</a></li>
<li><a href="#sec-2-9-11">2.9.11. 压缩镜像</a></li>
<li><a href="#sec-2-9-12">2.9.12. 添加镜像</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../layout/css/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../layout/css/style.css" />
<script src="../../layout/js/jquery_1.7.1.js"></script>
<script src="../../layout/js/bootstrap_old.js"></script>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> OpenStack命令</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 帮助</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
nova help
nova help|grep flavor
nova help flavor-list
</pre>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> nova network-list</h3>
<div class="outline-text-3" id="text-1-2">
<p>
查看创建的网络<br/>
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> nova-manage service list</h3>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> image操作</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> nova image-list</h4>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> tenant/user/role</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> 创建用户/租户/角色</h4>
<div class="outline-text-4" id="text-1-5-1">
<pre class="example">
keystone user-create --name=hui --pass=password --mail=hui@example.com
keystone tenant-create --name=acm
keystone role-create --name=compute-user
</pre>
</div>
</div>

<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> 列出用户/租户/角色</h4>
<div class="outline-text-4" id="text-1-5-2">
<pre class="example">
keystone user-list   
keystone role-list   
keystone tenant-list
</pre>
</div>
</div>

<div id="outline-container-sec-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> 添加用户到指定租户和角色中</h4>
<div class="outline-text-4" id="text-1-5-3">
<pre class="example">
keystone user-role-add --user=admin --tenant=admin --role=admin
</pre>
</div>
</div>

<div id="outline-container-sec-1-5-4" class="outline-4">
<h4 id="sec-1-5-4"><span class="section-number-4">1.5.4</span> 服务向Keystone注册服务的Endpoint</h4>
<div class="outline-text-4" id="text-1-5-4">
<pre class="example">
keystone service-create --name=keystone --type=identity --description="Keystone Identity Service"
会生成标识此服务的唯一ID
keystone endpoint-create  --service-id=上面生成的ID  --publicurl=http://controller:5000/v2.0  --internalurl=http://controller:5000/v2.0 --adminurl=http://controller:35357/v2.0
其中需要指定public/internal/admin的URL
</pre>
</div>
</div>
<div id="outline-container-sec-1-5-5" class="outline-4">
<h4 id="sec-1-5-5"><span class="section-number-4">1.5.5</span> 查看指定tenant的指定user的role</h4>
<div class="outline-text-4" id="text-1-5-5">
<pre class="example">
keystone user-role-list --user USERID --tenant TENANTID
</pre>
<p>
删除指定tenant的指定user的role<br/>
</p>
<pre class="example">
keystone user-role-remove --user USERID --tenant TENANTID --role ROLEID
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 安全组</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> nova secgroup-list</h4>
</div>
<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> nova secgroup-create GroupName Description</h4>
</div>
<div id="outline-container-sec-1-6-3" class="outline-4">
<h4 id="sec-1-6-3"><span class="section-number-4">1.6.3</span> nova secgroup-delete GroupName</h4>
</div>
<div id="outline-container-sec-1-6-4" class="outline-4">
<h4 id="sec-1-6-4"><span class="section-number-4">1.6.4</span> nova secgroup-list-rules GROUPNAME</h4>
</div>
<div id="outline-container-sec-1-6-5" class="outline-4">
<h4 id="sec-1-6-5"><span class="section-number-4">1.6.5</span> nova secgroup-add-rule default tcp 22 22 0.0.0.0/0</h4>
<div class="outline-text-4" id="text-1-6-5">
<p>
允许SSH登陆<br/>
</p>
</div>
</div>

<div id="outline-container-sec-1-6-6" class="outline-4">
<h4 id="sec-1-6-6"><span class="section-number-4">1.6.6</span> nova secgroup-add-rule default icmp -1 -1 0.0.0.0/0</h4>
<div class="outline-text-4" id="text-1-6-6">
<p>
允许ping<br/>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> floating ip</h3>
<div class="outline-text-3" id="text-1-7">
</div><div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> nova floating-ip-create</h4>
</div>
<div id="outline-container-sec-1-7-2" class="outline-4">
<h4 id="sec-1-7-2"><span class="section-number-4">1.7.2</span> nova floating-ip-associate InstanceNameOrID  Floating-Ip-Address</h4>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> VM操作</h3>
<div class="outline-text-3" id="text-1-8">
</div><div id="outline-container-sec-1-8-1" class="outline-4">
<h4 id="sec-1-8-1"><span class="section-number-4">1.8.1</span> nova boot &#x2013;flavor FLAVORTYPE &#x2013;key_name KEYPAIRNAME &#x2013;image IMAGEID NEWINSTANCENAME</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
启动一个实例<br/>
</p>
</div>
</div>

<div id="outline-container-sec-1-8-2" class="outline-4">
<h4 id="sec-1-8-2"><span class="section-number-4">1.8.2</span> nova delete VMName</h4>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> flavor操作</h3>
<div class="outline-text-3" id="text-1-9">
</div><div id="outline-container-sec-1-9-1" class="outline-4">
<h4 id="sec-1-9-1"><span class="section-number-4">1.9.1</span> nova flavor-list</h4>
</div>

<div id="outline-container-sec-1-9-2" class="outline-4">
<h4 id="sec-1-9-2"><span class="section-number-4">1.9.2</span> nova flavor-create FLAVOR_NAME FLAVOR_ID RAM_IN_MB ROOT_DISK_IN_GB NUMBER_OF_VCPUS</h4>
<div class="outline-text-4" id="text-1-9-2">
<p>
<a href="http://docs.openstack.org/user-guide-admin/content/cli_manage_flavors.html">http://docs.openstack.org/user-guide-admin/content/cli_manage_flavors.html</a><br/>
</p>
</div>
</div>

<div id="outline-container-sec-1-9-3" class="outline-4">
<h4 id="sec-1-9-3"><span class="section-number-4">1.9.3</span> nova flavor-access-add FLAVOR TENANT_ID</h4>
<div class="outline-text-4" id="text-1-9-3">
<p>
将其添加到指定tenant中<br/>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> hypervisor</h3>
<div class="outline-text-3" id="text-1-10">
<ol class="org-ol">
<li>nova hypervisor-list<br/>
</li>
<li>nova hypervisor-show HOSTNAME<br/>
</li>
<li>nova hypervisor-stats<br/>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 经验</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 重启OpenStack</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
##############################controller##############################
service openstack-nova-api restart
service openstack-nova-cert restart
service openstack-nova-conductor restart
service openstack-nova-consolerestart
service openstack-nova-consoleauth restart
service openstack-nova-metadata-apirestart
service openstack-nova-novncproxy restart
service openstack-nova-scheduler restart
##############################compute##############################
service openstack-nova-compute restart
#######################################################################
</pre>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 删除顺序</h3>
<div class="outline-text-3" id="text-2-2">
<p>
You need to delete the instances.<br/>
Delete the Floating Ips.<br/>
Then delete the Interfaces of Router and delete Router.<br/>
Then delete the subnets, network ports, and then the  Networks.<br/>
</p>
</div>
</div>
