linux/linuxos/CentOS集群安装OpenStack.org
** 端口映射访问VNC
   #+BEGIN_EXAMPLE
   nova get-vnc-console INSTANCE_NAME  novnc
   #+END_EXAMPLE
   得到类似http://192.168.1.105:6080/vnc_auto.html?token=246bf84d-1e92-48f0-8d03-cf9f50ed1dd8 的链接，在路由器上对6080进行端口映射，并用公网地址替换192.168.1.105。
** 自己创建镜像
   http://docs.openstack.org/image-guide/content/ubuntu-image.html
** 虚拟机启动时执行语句
   http://blog.csdn.net/juvxiao/article/details/22664457
** 修改镜像用户名和密码
   https://ask.openstack.org/en/question/4805/what-is-the-password-for-ubuntu-1204-cloud-image/
** 对象存储
   无论是放在DB中记录或OS中的文件或声音或图像，保存对象存储服务器中。
   Amazon AW3

   统一存储设备  bulk    传统：文件分成块存储
   硬件完成 块操作
   OS面对的是字节流
   
** 查看指定VM在哪台物理机上运行
   必须以admin用户查看
   #+BEGIN_EXAMPLE
   nova list --all-tenants  # 如果所要查看VM为其它tenant所有，需要--all-tenants
   nova show VM-ID
   #+END_EXAMPLE
** 制作镜像
   以制作centos6.5镜像为例，参考
   http://www.tuicool.com/articles/BNJZny (这篇文章不全，没有安装cloud-init等不能解决虚拟机自动扩展分区问题，参考以下官方文档)
   https://openstack.redhat.com/Creating_CentOS_and_Fedora_images_ready_for_Openstack
   http://www.chenshake.com/about-openstack-centos-mirror/
   http://docs.openstack.org/image-guide/content/centos-image.html
   以下操作在node1（装有centos 6.5）上进行
*** 安装底层支持包
    #+BEGIN_EXAMPLE
    yum groupinstall Virtualization "Virtualization Client"  
    yum install libvirt
    #+END_EXAMPLE
*** 下载centos6.5 iso镜像
    #+BEGIN_EXAMPLE
    mkdir /openstack-image
    cd /openstack-image
    wget ftp://ftp.sjtu.edu.cn/centos/6.5/isos/x86_64/CentOS-6.5-x86_64-bin-DVD1.iso
    #+END_EXAMPLE
*** 启动服务
    #+BEGIN_EXAMPLE
    service libvirtd restart
    #+END_EXAMPLE
*** 创建镜像文件
    #+BEGIN_EXAMPLE
    cd /openstack-image
    qemu-img create -f qcow2 CentOS6.5-openstack.img 10G
    chown qemu:qemu /openstack-image -R
    #+END_EXAMPLE
*** 创建虚拟机
    #+BEGIN_EXAMPLE
    virt-install -n CentOSimg -r 4096 --cpu host -c /openstack-image/CentOS-6.5-x86_64-bin-DVD1.iso --disk path=/openstack-image/CentOS6.5-openstack.img,device=disk,bus=virtio,size=30,format=qcow2 --vnc --vncport=5911 --vnclisten=0.0.0.0 -v
    #+END_EXAMPLE
*** 利用VNC软件登陆
    mac下可以使用chicken of the vnc来登陆，win下可以用vnc viewer.
    端口为上面指定的vncport=5911
    chicken of the vnc需要在port中填写11，会默认+5900得到5911
*** 安装系统
*** 配置系统
    可以用virsh list来看当前已启动的虚拟机。
    #+BEGIN_EXAMPLE
    virsh start CentOSimg  
    virsh list
    #+END_EXAMPLE
    查看确定是我们刚才制作的虚拟机"CentOSimg"重新开启了.
    之后再次用VNC连入到这个虚拟机中，端口不变，我们需要做下面的一些操作
**** 删除网络配置
     删除ifcfg-eth0的HWADDR一行，最后你的ifcfg-eth0的配置文件应该是这样的：
#+BEGIN_EXAMPLE
[root@localhost ~]# cat /etc/sysconfig/network-scripts/ifcfg-eth0 
DEVICE="eth0" 
BOOTPROTO="dhcp" 
NM_CONTROLLED="yes" 
ONBOOT="yes" 
TYPE="Ethernet"
#+END_EXAMPLE
**** 删除已生成的网络设备规则
#+BEGIN_EXAMPLE
rm -rf /etc/udev/rules.d/70-persistent-net.rules
#+END_EXAMPLE
**** 关闭防火墙和selinux
#+BEGIN_EXAMPLE
sed -i s/^SELINUX=.*/SELINUX=disabled/g /etc/selinux/config 
service iptables stop && chkconfig iptables off 
service ip6tables stop && chkconfig ip6tables off
#+END_EXAMPLE
*** 安装EPEL源，升级系统
    #+BEGIN_EXAMPLE
    yum install -y http://dl.fedoraproject.org/pub/epel/6/x86_64/epel-release-6-8.noarch.rpm
    yum -y distro-sync
    #+END_EXAMPLE
*** cloud-init等
    #+BEGIN_EXAMPLE
      yum install -y cloud-utils cloud-init parted git
      cd /tmp
      git clone https://github.com/flegmatik/linux-rootfs-resize.git
      cd linux-rootfs-resize
      ./install
    #+END_EXAMPLE
    修改/etc/cloud/cloud.cfg
    #+BEGIN_EXAMPLE
    disable_root: 0
    ssh_pwauth:   1 
    #+END_EXAMPLE
    否则不能root登陆。
    在cloud_init_modules下面添加
    #+BEGIN_EXAMPLE
    - resolv-conf
    #+END_EXAMPLE
    /etc/sysconfig/network中添加
    #+BEGIN_EXAMPLE
    NOZERCONF=yes
    #+END_EXAMPLE
*** 压缩镜像
    关闭虚拟机
    #+BEGIN_EXAMPLE
    init0 或者 poweroff
    #+END_EXAMPLE
    压缩镜像
    #+BEGIN_EXAMPLE
    # Reset and clean the image so it can be reused without issues
    virt-sysprep -d centos-6.5
    # Reduce image size by zero-in unused blocks in the virtual disk
    virt-sparsify --compress CentOS6.5-openstack.img centos-6.5-desktop.img
    #+END_EXAMPLE
*** 添加镜像
    #+BEGIN_EXAMPLE
    glance image-create --name "CentOS-6.5-Desktop-byFan" --disk-format qcow2 --container-format bare --is-public True --progress < /openstack-image/CentOS6.5-openstack.img
    #+END_EXAMPLE
