linux/linuxos/CentOS集群安装OpenStack.html

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 端口映射访问VNC</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
nova get-vnc-console INSTANCE_NAME  novnc
</pre>
<p>
得到类似<a href="http://192.168.1.105:6080/vnc_auto.html?token=246bf84d-1e92-48f0-8d03-cf9f50ed1dd8">http://192.168.1.105:6080/vnc_auto.html?token=246bf84d-1e92-48f0-8d03-cf9f50ed1dd8</a> 的链接，在路由器上对6080进行端口映射，并用公网地址替换192.168.1.105。<br/>
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 自己创建镜像</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="http://docs.openstack.org/image-guide/content/ubuntu-image.html">http://docs.openstack.org/image-guide/content/ubuntu-image.html</a><br/>
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 虚拟机启动时执行语句</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<a href="http://blog.csdn.net/juvxiao/article/details/22664457">http://blog.csdn.net/juvxiao/article/details/22664457</a><br/>
</p>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 修改镜像用户名和密码</h3>
<div class="outline-text-3" id="text-2-6">
<p>
<a href="https://ask.openstack.org/en/question/4805/what-is-the-password-for-ubuntu-1204-cloud-image/">https://ask.openstack.org/en/question/4805/what-is-the-password-for-ubuntu-1204-cloud-image/</a><br/>
</p>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 对象存储</h3>
<div class="outline-text-3" id="text-2-7">
<p>
无论是放在DB中记录或OS中的文件或声音或图像，保存对象存储服务器中。<br/>
Amazon AW3<br/>
</p>

<p>
统一存储设备  bulk    传统：文件分成块存储<br/>
硬件完成 块操作<br/>
OS面对的是字节流<br/>
</p>
</div>
</div>
<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> 查看指定VM在哪台物理机上运行</h3>
<div class="outline-text-3" id="text-2-8">
<p>
必须以admin用户查看<br/>
</p>
<pre class="example">
nova list --all-tenants  # 如果所要查看VM为其它tenant所有，需要--all-tenants
nova show VM-ID
</pre>
</div>
</div>

<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> 制作镜像</h3>
<div class="outline-text-3" id="text-2-9">
<p>
以制作centos6.5镜像为例，参考<br/>
<a href="http://www.tuicool.com/articles/BNJZny">http://www.tuicool.com/articles/BNJZny</a> (这篇文章不全，没有安装cloud-init等不能解决虚拟机自动扩展分区问题，参考以下官方文档)<br/>
<a href="https://openstack.redhat.com/Creating_CentOS_and_Fedora_images_ready_for_Openstack">https://openstack.redhat.com/Creating_CentOS_and_Fedora_images_ready_for_Openstack</a><br/>
<a href="http://www.chenshake.com/about-openstack-centos-mirror/">http://www.chenshake.com/about-openstack-centos-mirror/</a><br/>
<a href="http://docs.openstack.org/image-guide/content/centos-image.html">http://docs.openstack.org/image-guide/content/centos-image.html</a><br/>
以下操作在node1（装有centos 6.5）上进行<br/>
</p>
</div>
<div id="outline-container-sec-2-9-1" class="outline-4">
<h4 id="sec-2-9-1"><span class="section-number-4">2.9.1</span> 安装底层支持包</h4>
<div class="outline-text-4" id="text-2-9-1">
<pre class="example">
yum groupinstall Virtualization "Virtualization Client"  
yum install libvirt
</pre>
</div>
</div>

<div id="outline-container-sec-2-9-2" class="outline-4">
<h4 id="sec-2-9-2"><span class="section-number-4">2.9.2</span> 下载centos6.5 iso镜像</h4>
<div class="outline-text-4" id="text-2-9-2">
<pre class="example">
mkdir /openstack-image
cd /openstack-image
wget ftp://ftp.sjtu.edu.cn/centos/6.5/isos/x86_64/CentOS-6.5-x86_64-bin-DVD1.iso
</pre>
</div>
</div>

<div id="outline-container-sec-2-9-3" class="outline-4">
<h4 id="sec-2-9-3"><span class="section-number-4">2.9.3</span> 启动服务</h4>
<div class="outline-text-4" id="text-2-9-3">
<pre class="example">
service libvirtd restart
</pre>
</div>
</div>

<div id="outline-container-sec-2-9-4" class="outline-4">
<h4 id="sec-2-9-4"><span class="section-number-4">2.9.4</span> 创建镜像文件</h4>
<div class="outline-text-4" id="text-2-9-4">
<pre class="example">
cd /openstack-image
qemu-img create -f qcow2 CentOS6.5-openstack.img 10G
chown qemu:qemu /openstack-image -R
</pre>
</div>
</div>

<div id="outline-container-sec-2-9-5" class="outline-4">
<h4 id="sec-2-9-5"><span class="section-number-4">2.9.5</span> 创建虚拟机</h4>
<div class="outline-text-4" id="text-2-9-5">
<pre class="example">
virt-install -n CentOSimg -r 4096 --cpu host -c /openstack-image/CentOS-6.5-x86_64-bin-DVD1.iso --disk path=/openstack-image/CentOS6.5-openstack.img,device=disk,bus=virtio,size=30,format=qcow2 --vnc --vncport=5911 --vnclisten=0.0.0.0 -v
</pre>
</div>
</div>

<div id="outline-container-sec-2-9-6" class="outline-4">
<h4 id="sec-2-9-6"><span class="section-number-4">2.9.6</span> 利用VNC软件登陆</h4>
<div class="outline-text-4" id="text-2-9-6">
<p>
mac下可以使用chicken of the vnc来登陆，win下可以用vnc viewer.<br/>
端口为上面指定的vncport=5911<br/>
chicken of the vnc需要在port中填写11，会默认+5900得到5911<br/>
</p>
</div>
</div>

<div id="outline-container-sec-2-9-7" class="outline-4">
<h4 id="sec-2-9-7"><span class="section-number-4">2.9.7</span> 安装系统</h4>
</div>
<div id="outline-container-sec-2-9-8" class="outline-4">
<h4 id="sec-2-9-8"><span class="section-number-4">2.9.8</span> 配置系统</h4>
<div class="outline-text-4" id="text-2-9-8">
<p>
可以用virsh list来看当前已启动的虚拟机。<br/>
</p>
<pre class="example">
virsh start CentOSimg  
virsh list
</pre>
<p>
查看确定是我们刚才制作的虚拟机"CentOSimg"重新开启了.<br/>
之后再次用VNC连入到这个虚拟机中，端口不变，我们需要做下面的一些操作<br/>
</p>
</div>
<ol class="org-ol"><li>删除网络配置<br/><div class="outline-text-5" id="text-2-9-8-1">
<p>
删除ifcfg-eth0的HWADDR一行，最后你的ifcfg-eth0的配置文件应该是这样的：<br/>
</p>
<pre class="example">
[root@localhost ~]# cat /etc/sysconfig/network-scripts/ifcfg-eth0 
DEVICE="eth0" 
BOOTPROTO="dhcp" 
NM_CONTROLLED="yes" 
ONBOOT="yes" 
TYPE="Ethernet"
</pre>
</div>
</li>

<li>删除已生成的网络设备规则<br/><div class="outline-text-5" id="text-2-9-8-2">
<pre class="example">
rm -rf /etc/udev/rules.d/70-persistent-net.rules
</pre>
</div>
</li>

<li>关闭防火墙和selinux<br/><div class="outline-text-5" id="text-2-9-8-3">
<pre class="example">
sed -i s/^SELINUX=.*/SELINUX=disabled/g /etc/selinux/config 
service iptables stop &amp;&amp; chkconfig iptables off 
service ip6tables stop &amp;&amp; chkconfig ip6tables off
</pre>
</div>
</li></ol>
</div>

<div id="outline-container-sec-2-9-9" class="outline-4">
<h4 id="sec-2-9-9"><span class="section-number-4">2.9.9</span> 安装EPEL源，升级系统</h4>
<div class="outline-text-4" id="text-2-9-9">
<pre class="example">
yum install -y http://dl.fedoraproject.org/pub/epel/6/x86_64/epel-release-6-8.noarch.rpm
yum -y distro-sync
</pre>
</div>
</div>

<div id="outline-container-sec-2-9-10" class="outline-4">
<h4 id="sec-2-9-10"><span class="section-number-4">2.9.10</span> cloud-init等</h4>
<div class="outline-text-4" id="text-2-9-10">
<pre class="example">
yum install -y cloud-utils cloud-init parted git
cd /tmp
git clone https://github.com/flegmatik/linux-rootfs-resize.git
cd linux-rootfs-resize
./install
</pre>
<p>
修改/etc/cloud/cloud.cfg<br/>
</p>
<pre class="example">
disable_root: 0
ssh_pwauth:   1
</pre>
<p>
否则不能root登陆。<br/>
在cloud_init_modules下面添加<br/>
</p>
<pre class="example">
- resolv-conf
</pre>
<p>
/etc/sysconfig/network中添加<br/>
</p>
<pre class="example">
NOZERCONF=yes
</pre>
</div>
</div>

<div id="outline-container-sec-2-9-11" class="outline-4">
<h4 id="sec-2-9-11"><span class="section-number-4">2.9.11</span> 压缩镜像</h4>
<div class="outline-text-4" id="text-2-9-11">
<p>
关闭虚拟机<br/>
</p>
<pre class="example">
init0 或者 poweroff
</pre>
<p>
压缩镜像<br/>
</p>
<pre class="example">
# Reset and clean the image so it can be reused without issues
virt-sysprep -d centos-6.5
# Reduce image size by zero-in unused blocks in the virtual disk
virt-sparsify --compress CentOS6.5-openstack.img centos-6.5-desktop.img
</pre>
</div>
</div>

<div id="outline-container-sec-2-9-12" class="outline-4">
<h4 id="sec-2-9-12"><span class="section-number-4">2.9.12</span> 添加镜像</h4>
<div class="outline-text-4" id="text-2-9-12">
<pre class="example">
glance image-create --name "CentOS-6.5-Desktop-byFan" --disk-format qcow2 --container-format bare --is-public True --progress &lt; /openstack-image/CentOS6.5-openstack.img
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
